In [1]:
import numpy as np
import pandas as pd

In [2]:
user_data = {
    "MarksA" : np.random.randint(1,100,5),
    "MarksB" : np.random.randint(50,100,5),
    "MarksC" : np.random.randint(20,100,5)
    
}

In [3]:
user_data

{'MarksA': array([48, 45, 43, 40, 66]),
 'MarksB': array([95, 98, 98, 63, 71]),
 'MarksC': array([83, 77, 55, 38, 99])}

In [4]:
df = pd.DataFrame(user_data)
print(df)

   MarksA  MarksB  MarksC
0      48      95      83
1      45      98      77
2      43      98      55
3      40      63      38
4      66      71      99

In [5]:
df.head()

   MarksA  MarksB  MarksC
0      48      95      83
1      45      98      77
2      43      98      55
3      40      63      38
4      66      71      99

In [6]:
df.columns

Index(['MarksA', 'MarksB', 'MarksC'], dtype='object')

In [7]:
df.to_csv("marks.csv")

In [8]:
my_data = pd.read_csv("marks.csv")
#my_data = my_data.drop(columns=['Unnamed: 0'])
my_data

   Unnamed: 0  MarksA  MarksB  MarksC
0           0      48      95      83
1           1      45      98      77
2           2      43      98      55
3           3      40      63      38
4           4      66      71      99

In [9]:
my_data.describe()

       Unnamed: 0     MarksA     MarksB     MarksC
count    5.000000   5.000000   5.000000   5.000000
mean     2.000000  48.400000  85.000000  70.400000
std      1.581139  10.261579  16.718253  24.016661
min      0.000000  40.000000  63.000000  38.000000
25%      1.000000  43.000000  71.000000  55.000000
50%      2.000000  45.000000  95.000000  77.000000
75%      3.000000  48.000000  98.000000  83.000000
max      4.000000  66.000000  98.000000  99.000000

In [10]:
my_data.tail()

   Unnamed: 0  MarksA  MarksB  MarksC
0           0      48      95      83
1           1      45      98      77
2           2      43      98      55
3           3      40      63      38
4           4      66      71      99

In [12]:
my_data.iloc[3]

Unnamed: 0     3
MarksA        40
MarksB        63
MarksC        38
Name: 3, dtype: int64

In [13]:
my_data.iloc[3,1]

40